CONDITION = {
    'clear': 'Ясно ☀',
    'partly-cloudy': 'Малооблачно 🌤',
    'cloudy': 'Облачно с прояснениями 🌥',
    'overcast': 'Пасмурно ☁',
    'drizzle': 'Морось 🌦',
    'light-rain': 'Небольшой дождь 🌧',
    'rain': 'Дождь 🌧🌧',
    'moderate-rain': 'Умеренно сильный дождь 🌧🌧',
    'heavy-rain': 'Сильный дождь 🌧🌧🌧',
    'continuous-heavy-rain': 'Длительный сильный дождь 🌧🌧🌧🌧',
    'showers': 'Ливень 🌧🌧🌧🌧🌧',
    'wet-snow': 'Дождь со снегом 🌧🌨',
    'light-snow': 'Небольшой снег 🌨',
    'snow': 'Снег 🌨🌨',
    'snow-showers': 'Снегопад 🌨🌨🌨',
    'hail': 'Град 🧊🌧',
    'thunderstorm': 'Гроза 🌩',
    'thunderstorm-with-rain': 'Дождь с грозой ⛈',
    'thunderstorm-with-hail': 'Гроза с градом ⛈🧊',
}


qwerty = {
    'condition': 'облачно с прояснениями 🌥',
    'daytime': 'северный',
    'feels_like': -7,
    'humidity': 80,
    'icon': 'bkn_n',
    'obs_time': 1616180400,
    'polar': False,
    'pressure_mm': 745,
    'pressure_pa': 993,
    'season': 'spring',
    'temp': -3,
    'wind_dir': 'северный',
    'wind_gust': 5.4,
    'wind_speed': 2
}


MOON_CODE = {
    'moon-code-0': '🌕',
    'moon-code-1': '🌘',
    'moon-code-2': '🌘',
    'moon-code-3': '🌘',
    'moon-code-4': '🌗',
    'moon-code-5': '🌖',
    'moon-code-6': '🌖',
    'moon-code-7': '🌖',
    'moon-code-8': '🌑',
    'moon-code-9': '🌔',
    'moon-code-10': '🌔',
    'moon-code-11': '🌔',
    'moon-code-12': '🌓',
    'moon-code-13': '🌒',
    'moon-code-14': '🌒',
    'moon-code-15': '🌒',
}


DAYTIME = {
    'n': 'тёмное время суток',
    'd': 'светлое время суток',
}


WIND_DIR = {
    'nw': 'северо-западный',
    'n': 'северный',
    'ne': 'северо-восточный',
    'e': 'восточный',
    'se': 'юго-восточный',
    's': 'южный',
    'sw': 'юго-западный',
    'w': 'западный',
    'c': 'штиль',
}
